import jsImage1 from '../image/cardImage/JS1.jpg';
import pyImage1 from '../image/cardImage/PY1.png';
const data = [ 
    { 
        "quiz_id":1,
        "quiz_name":"Java-Script это",
        "quiz_description":"Тесты про JavaScript помогут вам проверить свои знания и понимание основ и особенностей этого популярного языка программирования. Вопросы охватывают такие темы, как синтаксис, структуры данных, функции, объекты и многие другие аспекты, которые являются основой для работы с JavaScript в веб-разработке.",
        "quiz_image":jsImage1,
        "quiz_category":"IT"
    },
    { 
        "quiz_id":2,
        "quiz_name":"История 20 века",
        "quiz_description":"Этот тест охватывает ключевые события и явления 20 века, включая мировые войны, революции, политические и социальные изменения. Вы сможете проверить свои знания о важных исторических личностях, значимых событиях и влиянии этих событий на современный мир.",
        "quiz_image":"",
        "quiz_category":"HISTORY"
    },
    { 
        "quiz_id":3,
        "quiz_name":"Основы Python",
        "quiz_description":"Тесты по основам Python предназначены для проверки ваших знаний о базовых концепциях этого мощного языка программирования. Вопросы охватывают синтаксис Python, работу с переменными, операторами, функциями, структурами данных, а также основы объектно-ориентированного программирования.",
        "quiz_image":pyImage1,
        "quiz_category":"IT"
    },
    { 
        "quiz_id":4,
        "quiz_name":"Мировая литература",
        "quiz_description":"Этот тест включает вопросы о самых известных произведениях мировой литературы, великих писателях и их стилях. Вы сможете проверить свои знания о различных литературных эпохах, жанрах и ключевых произведениях, которые оказали значительное влияние на развитие литературы и культуры.",
        "quiz_image":"",
        "quiz_category":"HISTORY"
    },
    { 
        "quiz_id":5,
        "quiz_name":"География Земли",
        "quiz_description":"Тесты по географии Земли помогут вам узнать больше о физических и политических особенностях планеты, включая континенты, страны, крупные города, климатические зоны и природные ресурсы. Вопросы охватывают как общие знания о географических объектах, так и более глубокие аспекты их формирования и распределения.",
        "quiz_image":"",
        "quiz_category":"HISTORY"
    },
    { 
        "quiz_id":6,
        "quiz_name":"Основы математики",
        "quiz_description":"Этот тест предназначен для проверки ваших знаний по основным концепциям математики, включая арифметику, алгебру, геометрию и статистику. Вопросы помогут вам оценить ваше понимание базовых математических операций, формул и теорем, а также навыков решения различных математических задач.",
        "quiz_image":"",
        "quiz_category":"MATH"
    }
];

export default data;
